package Mar22;

public class ClassBooking {
    /* int weight;
    if(end<=13{
        weight = end - start;
    } else if (start >= 13) {
        weight = (end - 13) * 2
    } else weight = 13 - start + (end - 13)*2 */
}

/*
* Задача: вызов лифта
В доме два лифта
реализовать алгоритм отправки наиближайшего на вызывающий этаж.

алгоритм будет применяться в домах разной этажности.

Пример:
в доме 19 этажей
работают лифт А и лифт В
лифт А находиться на 0 этаже
лифт В находиться на 8 этаже
на вход: 1
отправляем лифт А
* */